cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'doxygen'
brew 'git'
brew 'heroku'
brew 'heroku-toolbelt'
brew 'python'
brew 'postgresql'
brew 'redis'
brew 'thefuck'
brew 'tmux'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'alfred'
cask 'bartender'
#cask 'cleanmymac'
cask 'coderunner'
cask 'datagrip'
#cask 'evernote'
cask 'iterm2'
#cask 'karabiner'
#cask 'keyboard-maestro'
#cask 'flux'
cask 'goland'
cask 'google-chrome'
#cask 'hammerspoon'
cask 'lastpass'
cask 'p4merge'
cask 'path-finder'
cask 'pdf-expert'
cask 'pycharm'
cask 'sketchup'
cask 'spideroakone'
#cask 'switchresx'
cask 'ubersicht'
cask 'visual-studio-code'
#cask 'vlc'
cask 'webstorm'

