cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# System Utilities
# These are the things I want installed on every Mac I use.
cask 'font-fira-code-nerd-font'
#cask 'alfred'
cask 'bartender'
brew 'doxygen'
cask 'iterm2'
cask 'google-chrome'
#cask 'path-finder'
brew 'thefuck'
brew 'tmux'
cask 'vlc'
brew 'wget'
brew 'ranger'
brew 'peco'
brew 'tldr'                            # Condensed version of man
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'

# Workstation Applications
# These are the apps I usually want installed on a general purpose workstation.
#cask 'lastpass'
cask '1password'
cask 'azure-data-studio'
cask 'omnigraffle'
cask 'pdf-expert'
cask 'signal'
cask 'sketchup'
cask 'slack'
#cask 'spideroakone'
#cask 'sync'
cask 'transmission'
cask 'tunnelbear'
cask 'ubersicht'
cask 'zoom'                          # Zoom.us web conferencing app
brew 's-search'                      # Open a web search from the command line

# Programming Applications
# These are the apps I want installed on machines I program on.
cask 'boop'
cask 'coderunner'
cask 'datagrip'
brew 'git'
brew 'mercurial'
brew 'tig'
cask 'goland'
#brew 'heroku/brew/eeroku'
#brew 'heroku-toolbelt'
#cask 'p4merge'
cask 'postman'
cask 'pycharm'
brew 'redis'
cask 'rider'
#cask 'visual-studio'
cask 'visual-studio-code'
cask 'webstorm'
cask 'parallels'
cask 'adobe-creative-cloud'
#cask 'forticlient'
cask 'kaleidoscope'
#brew 'python'
brew 'pyenv'

# Manual Installations
# Adobe Creative Cloud
# Amphetamine
# Bear
# Docker
# Logitech Presentation Remote
# Magnet
# Office 365
# Pixelmator
# Popclip
# Sync
# Things
# Unclutter
# YubiKey Manager
# Atlassian Companion
# CheatSheet
# Cura
# PureRef
# MindNode
# Navicat
# Wacom Tablet
# SteelSeries Engine 3
# Xcode
# OmniGraffle
# Reeder
# Go
# AWS CLI
